src/Documents/РасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>РасходДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РасходДенежныхСредств/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(отказ, __)
	выполнитьВсеДвиженияДенежныеСредстваРасход(отказ, Истина, Истина);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Процедура выполнитьДвижениеДенежныеСредстваРасход(строкаРасходДС)
	движение = Движения.ДенежныеСредства.ДобавитьРасход();
	ЗаполнитьЗначенияСвойств(движение, строкаРасходДС);
КонецПроцедуры

Процедура выполнитьВсеДвиженияДенежныеСредстваРасход(отказ, Знач записывать = Истина, Знач контролироватьОстатки = Истина)
	выборкаРасходДС = получитьВыборкуДокументРасходДенежныхСредств(Ссылка);
	Если выборкаРасходДС = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Пока выборкаРасходДС.Следующий() Цикл
		выполнитьДвижениеДенежныеСредстваРасход(выборкаРасходДС);
	КонецЦикла;

	Если записывать Тогда
		Движения.ДенежныеСредства.Записывать = Истина;
		Движения.ДенежныеСредства.БлокироватьДляИзменения = Истина;

		Движения.Записать();
	КонецЕсли;

	Если контролироватьОстатки Тогда
		остаток = проверитьОстаткиДенежныхСредствПоКассе(ЭтотОбъект.Касса);

		Если остаток <> Неопределено Тогда
			отказ = Истина;
			остаток.Следующий();
			сообщениеПользователю = Новый СообщениеПользователю;
			сообщениеПользователю.Текст =
				СтрШаблон("По кассе ""%1"" недостаточно денежных средств для расхода в размере %2", остаток.Касса, остаток.Сумма);
			сообщениеПользователю.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция получитьВыборкуДокументРасходДенежныхСредств(документСсылка) // => Выборка | Неопределено
	запросРасходДС = Новый Запрос;
	запросРасходДС.УстановитьПараметр("Ссылка", документСсылка);

	запросРасходДС.Текст =
		"ВЫБРАТЬ
		|	РасходДенежныхСредств.Дата КАК Период,
		|	РасходДенежныхСредств.Касса КАК БанковскийСчетКасса,
		|	РасходДенежныхСредств.СуммаДокумента КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств
		|ИЗ
		|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|ГДЕ
		|	РасходДенежныхСредств.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходДенежныхСредств.Дата,
		|	РасходДенежныхСредств.Касса,
		|	РасходДенежныхСредств.СуммаДокумента
		|";

	результатЗапроса = запросРасходДС.Выполнить();
	Если результатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат результатЗапроса.Выбрать();
КонецФункции

// Выполняет поиск строки в {РегистреНакопления.ДенежныеСредства.Остатки}\
// с отрицательным значение поля СуммаОстаток по у казанной кассе.
// В случае если строка найдена - возвращает в виде { Касса: Строка, Сумма: Число }, иначе Неопределено
//
// Параметры:
//	касса - СправочникСсылка.Кассы
//
// Возвращаемое значение:
//	- Выборка
//	- Неопределено
Функция проверитьОстаткиДенежныхСредствПоКассе(касса = Неопределено) // => { Касса: Строка, Сумма: Число } | Неопределено
	касса = ?(касса = Неопределено, ЭтотОбъект.Касса, касса);

	запросОстаткиДС = Новый Запрос;
	запросОстаткиДС.УстановитьПараметр("Касса", касса);
	запросОстаткиДС.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));

	запросОстаткиДС.Текст =
		"ВЫБРАТЬ
		|	ДенежныеСредстваОстатки.БанковскийСчетКасса.Представление КАК Касса,
		|	ДенежныеСредстваОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(
		|		&МоментВремени,
		|		БанковскийСчетКасса = &Касса
		|			И ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)) КАК ДенежныеСредстваОстатки
		|ГДЕ
		|	ДенежныеСредстваОстатки.СуммаОстаток < 0
		|";

	результатЗапроса = запросОстаткиДС.Выполнить();
	Если результатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	выборка = результатЗапроса.Выбрать();

	Возврат выборка;
КонецФункции

#КонецОбласти
